/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 80022
Source Host           : localhost:3306
Source Database       : happy-shopping

Target Server Type    : MYSQL
Target Server Version : 80022
File Encoding         : 65001

Date: 2022-04-14 21:54:09
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `tb_mall_order`
-- ----------------------------
DROP TABLE IF EXISTS `tb_mall_order`;
CREATE TABLE `tb_mall_order` (
  `order_id` bigint NOT NULL AUTO_INCREMENT COMMENT '订单表主键id',
  `order_no` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '订单号',
  `user_id` bigint NOT NULL DEFAULT '0' COMMENT '用户主键id',
  `total_price` int NOT NULL DEFAULT '1' COMMENT '订单总价',
  `pay_status` tinyint NOT NULL DEFAULT '0' COMMENT '支付状态:0.未支付,1.支付成功,-1:支付失败',
  `pay_type` tinyint NOT NULL DEFAULT '0' COMMENT '0.无 1.支付宝支付 2.微信支付',
  `pay_time` datetime DEFAULT NULL COMMENT '支付时间',
  `order_status` tinyint NOT NULL DEFAULT '0' COMMENT '订单状态:0.待支付 1.已支付 2.配货完成 3:出库成功 4.交易成功 -1.手动关闭 -2.超时关闭 -3.商家关闭',
  `extra_info` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '订单body',
  `user_name` varchar(30) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '收货人姓名',
  `user_phone` varchar(11) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '收货人手机号',
  `user_address` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL DEFAULT '' COMMENT '收货人收货地址',
  `is_deleted` tinyint NOT NULL DEFAULT '0' COMMENT '删除标识字段(0-未删除 1-已删除)',
  `create_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `update_time` datetime NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '最新修改时间',
  PRIMARY KEY (`order_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=77 DEFAULT CHARSET=utf8 ROW_FORMAT=DYNAMIC COMMENT='订单表';

-- ----------------------------
-- Records of tb_mall_order
-- ----------------------------
INSERT INTO `tb_mall_order` VALUES ('1', '15688187285093508', '1', '2492', '1', '2', '2019-09-18 23:00:18', '-1', '', '', '', 'xafsdufhpwe', '0', '2019-09-18 22:53:07', '2019-09-18 22:55:32');
INSERT INTO `tb_mall_order` VALUES ('2', '15688188616936181', '1', '135', '1', '1', '2019-09-18 23:01:06', '1', '', '', '', 'xafsdufhpwe', '0', '2019-09-18 22:55:20', '2019-09-18 23:01:06');
INSERT INTO `tb_mall_order` VALUES ('3', '15689089426956979', '1', '15487', '1', '1', '2019-09-20 00:16:03', '3', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-19 23:56:40', '2019-09-20 00:10:39');
INSERT INTO `tb_mall_order` VALUES ('4', '15689090398492576', '1', '8499', '0', '0', null, '0', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-19 23:58:18', '2019-09-19 23:58:18');
INSERT INTO `tb_mall_order` VALUES ('5', '15689096266448452', '1', '115', '1', '2', '2019-09-20 00:13:52', '1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-20 00:08:04', '2019-09-20 00:13:52');
INSERT INTO `tb_mall_order` VALUES ('6', '15691645776131562', '7', '7998', '1', '1', '2019-09-22 23:05:53', '1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-22 22:57:15', '2019-09-22 23:05:53');
INSERT INTO `tb_mall_order` VALUES ('7', '15691648465397435', '7', '13998', '1', '2', '2019-09-22 23:07:38', '-1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-22 23:01:44', '2019-09-22 23:02:10');
INSERT INTO `tb_mall_order` VALUES ('8', '15691649071896878', '7', '1246', '1', '1', '2019-09-22 23:08:31', '1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-22 23:02:45', '2019-09-22 23:08:31');
INSERT INTO `tb_mall_order` VALUES ('9', '15691649748362177', '7', '25656', '1', '1', '2019-09-22 23:09:39', '4', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-22 23:03:52', '2019-09-22 23:50:45');
INSERT INTO `tb_mall_order` VALUES ('10', '15691652286194502', '7', '16197', '0', '0', null, '0', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-22 23:08:06', '2019-09-22 23:08:06');
INSERT INTO `tb_mall_order` VALUES ('11', '15692210075967186', '6', '5999', '1', '2', '2019-09-23 17:03:05', '1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-23 14:43:27', '2019-09-23 17:03:05');
INSERT INTO `tb_mall_order` VALUES ('12', '15692218454123239', '6', '7245', '0', '0', null, '0', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-23 14:57:25', '2019-09-23 14:57:25');
INSERT INTO `tb_mall_order` VALUES ('13', '15692225252983527', '6', '5488', '1', '2', '2019-09-23 15:38:54', '1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-23 15:08:45', '2019-09-23 15:38:54');
INSERT INTO `tb_mall_order` VALUES ('14', '15692291639125640', '6', '9046', '1', '2', '2019-09-23 16:59:32', '-1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2709', '0', '2019-09-23 16:59:23', '2019-09-23 16:59:40');
INSERT INTO `tb_mall_order` VALUES ('15', '15692295348262843', '6', '65', '1', '2', '2019-09-23 17:06:17', '1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2709', '0', '2019-09-23 17:05:34', '2019-09-23 17:06:17');
INSERT INTO `tb_mall_order` VALUES ('16', '15692298037679052', '6', '15233', '1', '2', '2019-09-23 17:10:08', '1', '', '', '', '上海浦东新区XX路XX号 999 137xxxx7797', '0', '2019-09-23 17:10:03', '2019-09-23 17:10:08');
INSERT INTO `tb_mall_order` VALUES ('17', '15694781962831307', '7', '1246', '1', '2', '2019-09-26 14:10:12', '-1', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-26 14:09:56', '2019-09-26 14:10:22');
INSERT INTO `tb_mall_order` VALUES ('18', '15698039249771093', '7', '3199', '0', '0', null, '0', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-09-30 08:38:26', '2019-09-30 08:38:26');
INSERT INTO `tb_mall_order` VALUES ('19', '15702783557537865', '7', '6819', '0', '0', null, '0', '', '', '', '杭州市西湖区xx小区x幢419 十三 137xxxx2703', '0', '2019-10-05 20:20:10', '2019-10-05 20:20:10');
INSERT INTO `tb_mall_order` VALUES ('20', '15702847670935185', '6', '3999', '1', '2', '2019-10-05 22:13:03', '1', '', '', '', '上海浦东新区XX路XX号 999 137xxxx7797', '0', '2019-10-05 22:12:47', '2019-10-05 22:13:03');
INSERT INTO `tb_mall_order` VALUES ('21', '16477418014659798', '9', '1998', '1', '1', '2022-03-20 10:03:33', '1', '', '', '', '广东省湛江市霞山区111号', '0', '2022-03-20 10:03:21', '2022-03-20 10:03:33');
INSERT INTO `tb_mall_order` VALUES ('22', '16481130389852891', '9', '15332', '1', '1', '2022-03-24 17:10:46', '1', '', '', '', '广东省湛江市霞山区111号', '0', '2022-03-24 17:10:38', '2022-03-24 17:10:46');
INSERT INTO `tb_mall_order` VALUES ('23', '16481133030248301', '9', '999', '1', '2', '2022-03-24 17:15:10', '1', '', '', '', '广东省湛江市霞山区111号', '0', '2022-03-24 17:15:03', '2022-03-24 17:15:10');
INSERT INTO `tb_mall_order` VALUES ('24', '16482187694749484', '9', '21133', '1', '2', '2022-03-25 22:33:05', '3', '', '', '', '广东省湛江市霞山区2号', '0', '2022-03-25 22:32:49', '2022-03-25 22:43:36');
INSERT INTO `tb_mall_order` VALUES ('25', '16482196218356520', '9', '9999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-03-25 22:47:01', '2022-03-25 22:47:01');
INSERT INTO `tb_mall_order` VALUES ('26', '16482200716456679', '9', '8499', '1', '1', '2022-03-25 22:54:37', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-03-25 22:54:31', '2022-03-25 22:54:37');
INSERT INTO `tb_mall_order` VALUES ('27', '16483923684405972', '9', '999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-03-27 22:46:08', '2022-03-27 22:46:08');
INSERT INTO `tb_mall_order` VALUES ('28', '16483924290043237', '9', '999', '1', '2', '2022-03-27 23:05:21', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-03-27 22:47:09', '2022-03-27 23:05:21');
INSERT INTO `tb_mall_order` VALUES ('29', '16484606321349316', '12', '6799', '1', '1', '2022-03-28 17:43:57', '-1', '', '', '', '广东省湛江市霞山区112号', '0', '2022-03-28 17:43:52', '2022-03-28 17:44:15');
INSERT INTO `tb_mall_order` VALUES ('30', '16488011572401631', '9', '20842', '1', '2', '2022-04-01 16:19:22', '-3', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-01 16:19:17', '2022-04-09 15:41:53');
INSERT INTO `tb_mall_order` VALUES ('31', '16494742956621588', '9', '33209', '1', '1', '2022-04-09 11:18:22', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-09 11:18:15', '2022-04-09 11:18:22');
INSERT INTO `tb_mall_order` VALUES ('32', '16495090951745912', '12', '12796', '1', '1', '2022-04-09 20:58:21', '1', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 20:58:15', '2022-04-09 20:58:21');
INSERT INTO `tb_mall_order` VALUES ('33', '16495115294483093', '12', '3199', '1', '1', '2022-04-09 21:38:54', '1', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 21:38:49', '2022-04-09 21:38:54');
INSERT INTO `tb_mall_order` VALUES ('34', '16495120643027469', '12', '3199', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 21:47:44', '2022-04-09 21:47:44');
INSERT INTO `tb_mall_order` VALUES ('35', '16495125910778184', '12', '3199', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 21:56:31', '2022-04-09 21:56:31');
INSERT INTO `tb_mall_order` VALUES ('36', '16495125926362236', '12', '3199', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 21:56:32', '2022-04-09 21:56:32');
INSERT INTO `tb_mall_order` VALUES ('37', '16495125940917007', '12', '3199', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 21:56:34', '2022-04-09 21:56:34');
INSERT INTO `tb_mall_order` VALUES ('38', '16495129786003604', '12', '3199', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 22:02:58', '2022-04-09 22:02:58');
INSERT INTO `tb_mall_order` VALUES ('39', '16495130065211398', '12', '3199', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 22:03:26', '2022-04-09 22:03:26');
INSERT INTO `tb_mall_order` VALUES ('40', '16495130118413705', '12', '3199', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 22:03:31', '2022-04-09 22:03:31');
INSERT INTO `tb_mall_order` VALUES ('41', '16495130507649538', '12', '3199', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区112号', '0', '2022-04-09 22:04:10', '2022-04-09 22:04:10');
INSERT INTO `tb_mall_order` VALUES ('42', '16495794297051740', '9', '3199', '1', '1', '2022-04-10 16:30:42', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-10 16:30:29', '2022-04-10 16:30:42');
INSERT INTO `tb_mall_order` VALUES ('43', '16495795690963558', '9', '3199', '1', '1', '2022-04-10 16:32:54', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-10 16:32:49', '2022-04-10 16:32:54');
INSERT INTO `tb_mall_order` VALUES ('44', '16495865001728401', '9', '12999', '1', '2', '2022-04-10 18:28:24', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-10 18:28:20', '2022-04-10 18:28:24');
INSERT INTO `tb_mall_order` VALUES ('45', '16495865976342349', '9', '12999', '1', '2', '2022-04-10 18:30:01', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-10 18:29:57', '2022-04-10 18:30:01');
INSERT INTO `tb_mall_order` VALUES ('46', '16495867349908741', '9', '9999', '1', '2', '2022-04-10 18:32:19', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-10 18:32:14', '2022-04-10 18:32:19');
INSERT INTO `tb_mall_order` VALUES ('47', '16495867547163886', '9', '6799', '1', '2', '2022-04-10 18:32:40', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-10 18:32:34', '2022-04-10 18:32:40');
INSERT INTO `tb_mall_order` VALUES ('48', '16496444880651541', '9', '12999', '1', '1', '2022-04-11 10:35:44', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:34:48', '2022-04-11 10:35:44');
INSERT INTO `tb_mall_order` VALUES ('49', '16496448694074666', '9', '13598', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:41:09', '2022-04-11 10:41:09');
INSERT INTO `tb_mall_order` VALUES ('50', '16496449343066420', '9', '6398', '1', '1', '2022-04-11 10:42:19', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:42:14', '2022-04-11 10:42:19');
INSERT INTO `tb_mall_order` VALUES ('51', '16496450199839501', '9', '12999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:43:49', '2022-04-11 10:43:49');
INSERT INTO `tb_mall_order` VALUES ('52', '16496450399915030', '9', '12999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:43:59', '2022-04-11 10:43:59');
INSERT INTO `tb_mall_order` VALUES ('53', '16496450433091109', '9', '12999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:44:03', '2022-04-11 10:44:03');
INSERT INTO `tb_mall_order` VALUES ('54', '16496450806851989', '9', '12999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:44:40', '2022-04-11 10:44:40');
INSERT INTO `tb_mall_order` VALUES ('55', '16496450816606991', '9', '12999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:44:41', '2022-04-11 10:44:41');
INSERT INTO `tb_mall_order` VALUES ('56', '16496450824639760', '9', '12999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:44:42', '2022-04-11 10:44:42');
INSERT INTO `tb_mall_order` VALUES ('57', '16496451404255237', '9', '9999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:45:40', '2022-04-11 10:45:40');
INSERT INTO `tb_mall_order` VALUES ('58', '16496452325276204', '9', '7998', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:47:12', '2022-04-11 10:47:12');
INSERT INTO `tb_mall_order` VALUES ('59', '16496452538751166', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:47:33', '2022-04-11 10:47:33');
INSERT INTO `tb_mall_order` VALUES ('60', '16496454300911799', '9', '9999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 10:50:30', '2022-04-11 10:50:30');
INSERT INTO `tb_mall_order` VALUES ('61', '16496460639669820', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:01:03', '2022-04-11 11:01:03');
INSERT INTO `tb_mall_order` VALUES ('62', '16496461038884139', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:01:43', '2022-04-11 11:01:43');
INSERT INTO `tb_mall_order` VALUES ('63', '16496461070549270', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:01:47', '2022-04-11 11:01:47');
INSERT INTO `tb_mall_order` VALUES ('64', '16496461092085567', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:01:49', '2022-04-11 11:01:49');
INSERT INTO `tb_mall_order` VALUES ('65', '16496461356142403', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:02:15', '2022-04-11 11:02:15');
INSERT INTO `tb_mall_order` VALUES ('66', '16496462403584179', '9', '3999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:04:00', '2022-04-11 11:04:00');
INSERT INTO `tb_mall_order` VALUES ('67', '16496462427491358', '9', '3999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:04:02', '2022-04-11 11:04:02');
INSERT INTO `tb_mall_order` VALUES ('68', '16496462447975578', '9', '3999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:04:04', '2022-04-11 11:04:04');
INSERT INTO `tb_mall_order` VALUES ('69', '16496462781611791', '9', '3999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:04:38', '2022-04-11 11:04:38');
INSERT INTO `tb_mall_order` VALUES ('70', '16496463720095073', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:06:12', '2022-04-11 11:06:12');
INSERT INTO `tb_mall_order` VALUES ('71', '16496466904735416', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:11:30', '2022-04-11 11:11:30');
INSERT INTO `tb_mall_order` VALUES ('72', '16496468177037990', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:13:37', '2022-04-11 11:13:37');
INSERT INTO `tb_mall_order` VALUES ('73', '16496468774161103', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:14:37', '2022-04-11 11:14:37');
INSERT INTO `tb_mall_order` VALUES ('74', '16496474897549677', '9', '6799', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:24:49', '2022-04-11 11:24:49');
INSERT INTO `tb_mall_order` VALUES ('75', '16496476888461304', '9', '3999', '0', '0', null, '0', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:28:08', '2022-04-11 11:28:08');
INSERT INTO `tb_mall_order` VALUES ('76', '16496477075936476', '9', '6799', '1', '1', '2022-04-11 11:28:33', '1', '', '', '', '广东省湛江市霞山区2号', '0', '2022-04-11 11:28:27', '2022-04-11 11:28:33');
